tap "asmvik/formulae"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae", trusted: true
tap "jstkdng/programs"
tap "nikitabobko/tap", trusted: { casks: ["aerospace"] }
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Deduplicating archiver with compression and authenticated encryption
brew "borgbackup"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU File, Shell, and Text utilities
brew "coreutils"
# More intuitive version of du in rust
brew "dust"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Terminal file manager
brew "lf"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Markup-based typesetting system
brew "typst"
# Extraction utility for .zip compressed archives
brew "unzip"
# URL extractor/launcher
brew "urlview"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Compression and file packaging/archive utility
brew "zip"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Simple hotkey-daemon for macOS.
brew "asmvik/formulae/skhd", trusted: true
# A tiling window manager for macOS based on binary space partitioning.
brew "asmvik/formulae/yabai", trusted: true
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp", trusted: true
# GPU-accelerated terminal emulator
cask "alacritty"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Web browser
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Keyboard customiser
cask "karabiner-elements"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "vscodevim.vim"
